c5/src/Documents/ClosingAdvancesGiven/ClosingAdvancesGiven.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ClosingAdvancesGiven</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Advances</name>
    <attributes>
      <name>AdvanceAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CloseAdvance</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.Contracts</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Vendor</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
    <attributes>
      <name>VendorAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Catalogs/Organizations/Organizations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Organizations</name>
  <basedOn>Catalog.Leads</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Address</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Alien</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Birthplace</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Chain</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>CodeFiscal</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerType</name>
    <type>
      <types>EnumRef.CustomerTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssuedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ItemsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObjectUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Phone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Policy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Salesman</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>SIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>VATCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
  <attributes>
    <name>Wholesaler</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ApprovalList</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Priority</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Properties</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.Properties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Documents/ClosingAdvancesGiven/Forms/Form/Module.bsl
&AtClient
var AdvancesRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Constraints.ShowAccess ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		DocumentForm.Init ( Object );
		fillNew ();
		Constraints.ShowAccess ( ThisObject );
	endif;
	Options.Company ( ThisObject, Object.Company );
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Warning UndoPosting show Object.Posted;
	|Advances Date Company AdvanceAccount AdvanceCurrencyAccount lock Object.Posted;
	|AdvancesFill enable not Object.Posted
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif; 
	settings = Logins.Settings ( "Company" );
	Object.Company = settings.Company;
	CalculationsForm.SetDate ( Object );
	
EndProcedure 

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure Fill ( Command )
	
	runFilling ();
	
EndProcedure

&AtClient
Procedure runFilling ()
	
	if ( Forms.Check ( ThisObject, "Company" ) ) then
		params = fillingParams ();
		Filler.Open ( params, ThisObject );
	endif; 
	
EndProcedure 

&AtServer
Function fillingParams ()
	
	p = Filler.GetParams ();
	p.Report = "ClosingAdvancesGiven";
	p.Filters = getFilters ();
	p.Background = true;
	return p;
	
EndFunction

&AtServer
Function getFilters ()
	
	filters = new Array ();
	item = DC.CreateParameter ( "Date", Object.Date );
	filters.Add ( item );
	item = DC.CreateParameter ( "Company", Object.Company );
	filters.Add ( item );
	accounts = AccountsMap.Organization ( Catalogs.Organizations.EmptyRef (), Object.Company,
		"VendorAccount, AdvanceGiven" );
	item = DC.CreateParameter ( "Account", accounts.VendorAccount );
	filters.Add ( item );
	item = DC.CreateParameter ( "AdvanceAccount", accounts.AdvanceGiven );
	filters.Add ( item );
	return filters;
	
EndFunction

&AtClient
Procedure Filling ( Result, Params ) export
	
	if ( not fillAdvances ( Result ) ) then
		Output.FillingDataNotFound ();
	endif;

EndProcedure

&AtServer
Function fillAdvances ( val Result ) 

	data = Filler.Fetch ( Result );
	if ( data = undefined ) then
		return false;
	endif;
	advances = Object.Advances;
	if ( Result.ClearTable ) then
		advances.Clear ();
	endif; 
	for each rowData in data do
		row = advances.Add ();
		FillPropertyValues ( row, rowData );
	enddo;
	return true;

EndFunction

&AtClient
Procedure DateChoiceProcessing ( Item, SelectedValue, StandardProcessing )
	
	SelectedValue = EndOfDay ( SelectedValue );
	
EndProcedure

// *****************************************
// *********** Table Advances

&AtClient
Procedure AdvancesBeforeRowChange ( Item, Cancel )
	
	enableCurrency ();
	
EndProcedure

&AtClient
Procedure enableCurrency () 

	if ( AdvancesRow = undefined ) then
		return;
	endif;
	flag = not DF.Pick ( AdvancesRow.VendorAccount, "Currency" );
	Items.AdvancesCurrency.ReadOnly = flag;
	Items.AdvancesCurrencyAmount.ReadOnly = flag;

EndProcedure

&AtClient
Procedure AdvancesOnActivateRow ( Item )
	
	AdvancesRow = Item.CurrentData;
	enableCurrency ();
	
EndProcedure

&AtClient
Procedure AdvancesVendorOnChange ( Item )
	
	applyVendor ();
	
EndProcedure

&AtClient
Procedure applyVendor () 

	data = getAdvancesData ( AdvancesRow.Vendor, AdvancesRow.VendorAccount, Object.Company );
	AdvancesRow.Contract = data.Contract;
	AdvancesRow.Currency = data.Currency;

EndProcedure

&AtServerNoContext
Function getAdvancesData ( val Vendor, val Account, val Company ) 

	data = new Structure ();
	data.Insert ( "Contract" );
	data.Insert ( "Currency" );
	vendorData = DF.Values ( Vendor, "VendorContract, VendorContract.Company as Company, VendorContract.Currency as Currency" );
	if ( vendorData.Company = Company ) then
		data.Contract = vendorData.VendorContract;
		if ( DF.Pick ( Account, "Currency" ) ) then
			data.Currency = vendorData.Currency;
		endif;
	endif;
	return data;

EndFunction

&AtClient
Procedure AdvancesVendorAccountOnChange ( Item )
	
	enableCurrency ();
	clearCurrency ();
	
EndProcedure

&AtClient
Procedure clearCurrency () 

	if ( not DF.Pick ( AdvancesRow.VendorAccount, "Currency" ) ) then
		AdvancesRow.Currency = undefined;
		AdvancesRow.CurrencyAmount = undefined;
	endif;

EndProcedure

&AtClient
Procedure AdvancesContractOnChange ( Item )
	
	applyContract ();
	
EndProcedure

&AtClient
Procedure applyContract () 

	AdvancesRow.Currency = getCurrency ( AdvancesRow.Contract, AdvancesRow.VendorAccount );

EndProcedure

&AtServerNoContext
Function getCurrency ( val Contract, val Account ) 

	if ( DF.Pick ( Account, "Currency" ) ) then
		return DF.Pick ( Contract, "Currency" );
	else
		return undefined
	endif;

EndFunction
